datasets/bench4bl/spring-ws/queries/long/637.txt

The actual problem that I have is that I cannot send attachments with Jax-ws -client. It seems like Mtom is disabled.
In order to see soap request i have had an SoapEnvelopeLoggingInterceptor interceptor  to the spring-ws-servlet.xml






 <bean class="org.springframework.ws.server.endpoint.mapping.PayloadRootAnnotationMethodEndpointMapping">




    <property name="interceptors">




      <list>




         <bean class="org.springframework.ws.soap.server.endpoint.interceptor.SoapEnvelopeLoggingInterceptor">




           <property name="logResponse" value="false"/>




         </bean>         




      </list>




    </property>




  </bean>












<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">




<S:Body>




  <StoreImageRequest xmlns="http://www.springframework.org/spring-ws/samples/mtom">




    <name>logo.png</name>




    <image>iVBORw0K(.....)gg==</image>




  </StoreImageRequest></S:Body>




</S:Envelope>





 